// 'number' + 3 + 3   -> 'number33', конкатенація

// null + 3   -> 3  null, приводиться до 0

// 5 && "qwerty" -> "qwerty", оператор && повертає перше фолс або останнє істинне значчення

// +'40' + +'2' + "hillel";  -> '42hillel', унарний + перетворює рядки в числа( тобто виконається умова додавання 40 + 2 ), потім конкатенація з рядком

// '10' - 5 === 6; -> false, тобто при відніманні, якщо це можливо, приводимо рядок до числа (10 -5 = 5) і порівнюємо з 6, отримуємо false

// true + false -> 1, true приводиться до 1, false до 0

// '4px' - 3 -> NaN, рядок не можна привести до числа, а при відніманні рядка від числа отримуємо NaN

// '4' - 3 -> 1, рядок приводиться до числа

// '6' + 3 ** 0  -> '61',  спочатку виконається 3 ** 0 = 1, потім конкатенація '6' + 1 = '61'

// 12 / '6' -> 2, рядок приводиться до числа та виконується ділення

// '10' + (5 === 6); -> '10false', ми виконуємо першу дію 5 === 6 повертає false, далі у нас буде конкатенація 

// null == '' -> false, тому що при не строгому порівннянні null рівний тільки undefined

// 3 ** (9 / 3); -> 27, правило математики дія в дужках виконується першою(буде 3), потім піднесення до степеня 

// !!'false' == !!'true' -> true, спочатку інвертуємо значення, потім інвертуємо значення(тобто повертаємо до початкового значення)
//  обидва рядки непорожні, тому приводяться до true

// 0 || '0' && 1 -> 1, так як оператор && має вищий пріорітет то виконується першим то повертає перше фолс або останнє істинне значчення (тобто 1), 
// далі оператор || повертає 1,  тобто перше істинне значення

// (+null == false) < 1 -> false , спочатку виконуємо порівняння +null == false, де +null приводиться до 0, false приводиться до 0, отже 0 == 0 повертає true(1), 
// далі виконуємо порівняння 1 < 1, що повертає false

// false && true || true -> true, спочатку виконуємо оператор && який повертає перше фолс а потім виконуємо оператор || який повертає перше істинне значення(тобто true)
// false && (false || true) -> false, спочатку виконуємо оператор ||(тому що він в дужках і виконується першим в даному випадку) який повертає перше істинне значення(тобто true), а потім виконуємо оператор && який повертає перше фолс

// (+null == false) < 1 ** 5 -> false , спочатку виконуємо піднесення до степеня 1 ** 5 = 1, далі виконуємо порівняння +null == false, де +null приводиться до 0, false приводиться до 0, отже 0 == 0 повертає true(1), 
// далі виконуємо порівняння 1 < 1, що повертає false


